(function (global) {
  // https://ta19.site/2019/04/16/tarot-card-meaning/
  const majorArcana = [{
      name: 'fool',
      title: '愚者 Fool-Child',
      // mean: '旅程',
      keyword: '自由的靈魂、至善的愚人、傻瓜、初學者、受祝福者、蒙卦',
      text: '就像胎兒和依賴的小孩，依靠著對宇宙秩序的相信而生存。知道你是被照顧的。在接受這樣的法則下(相信宇宙)，你可以當個愚者:你可以放輕鬆、做自己、冒險、玩樂。作為一個純真的愚者和天真的小孩，保持開放性和好奇心這種接納性高的心智使你變得富有直覺、有原創性、自發性且活在當下。允許你自然的天赋展現出來。像個孩子。你有驚人的生命力，一股朝氣蓬勃的年輕能量蠢套欲動讓你想要去體驗和學習就算過程中偶爾摔了一致，那也是成長的一環。作為這張牌的數字「0」 你就像靈魂，無所不在也不存在，迷個又篤定，年轻卻有智慧，愚蠢但又認真。遵循著聖靈(你的巨嘴鳥天使會指引)，而不是講究實際和傳統的。採取這樣一個大冒險也許使你在物質世界裡可能會被愚弄，但也賦予你一個重生的機會，透過一種奧秘、超越性的體驗而帶來一股新的氣息(伊厄科特爾Ehecatl-阿茲特克的風之神來象徵)，代表一個新的人生和新的開始。<br>陰暗面或消極面:你可能永遠不會「成熟」進入到成年，就像個孩童一樣保持著「永不成熟的單純」，因此也不會承擔責任，持續的依賴、天真、不實際和毫無力量。'
    },
    {
      name: 'magician',
      title: '魔術師 Magician',
      // mean: '創造',
      keyword: '九型人格第三型、表演者、顯化者、魅力者、薩滿巫師、乾卦',
      text: '魔術師象徵「天賦才能」法則。如同魔術師手中所展現的，宇宙賦予你多樣的才華 就像印加面具的黄金是從大地中所挖掘提煉出來的去發堀你的各種技能，創造你所想要的。像個薩滿巫師一樣，上任一種面具，化身為任一種人。<br>魔術師伸出給子之手，象徵在你掌中已具足各種才能，代表你可以由展現内在資源去實現你各種抱負的能力。身為魔術師你的數字是「1」，代表「0」道靈魂以實體形式來顯化你是一個轉換者和形體化的使者一顯化你的願景和夢想。你可以創造奇蹟。<br>魔法Magic這個字源自古字「magh」意思是「力量」。你的力量來源於成為宇宙的一個通道，從宇宙接收到直覺的指引並且迅速和果決的行動。<br>魔術師代表你能夠透過圖繪或文字把事情概念化的能力;文字是經由腦(大腦神經元構想出來並透過書寫具體展現出來(石碑)就像作為水星(星球-水星)，你擁有溝通的天賦。你腦中的每個想法和從你口中所說出的每句話，就像一座發射器足以引爆出一股靈感和啟發的力量。開啟其他人去發掘他們自己所擁有的魔法!<br>你的魔法權杖就是你的感知。當魔術師透過多彩變化的權杖去看世界時。他可以察覺到各種不同可能性的世界。「真實」只有在心智有所覺察時存在。花朵可以是一叢鬱金香或是一隻公雞。去看一看。 魔術師的金色王冠，即是你正面的思想態度。授與你在現實世界裡能以很實質的方式來顯化你的願景與想法。相信所有事情都是有可能性的。那麼生命就會是豐盛、令人與奮。不可思議且神奇的。<br>陰暗面或消極面:誤用或濫用力量和天賦去操縱。欺騙。 設計和控制 一即是黑魔法。'
    },
    {
      name: 'highPriestess',
      title: '女祭師 Priestess',
      // mean: '智慧',
      keyword: '九型人格第五型、觀察者、療癒者、直覺者、神諭者、坤卦',
      text: '身為女祭司，你象徵「知識」法則:你知道真相。透過内在的平靜和均衡去看見隱藏在表面下的是什麼。去了解你自己。就像你的數字「2」一那樣的平和及平衡，你可以客觀的去看待自己。<br>透過你的夢和靜心，允許你的潛意識(以月亮來象徵)提升到意識覺察的表面。你猶如水一般的感受力，讓你成為反映的水池一別人的一面明鏡。你是個詢顧問，有智慧的貓頭鷹。<br>像海豚一樣透過振動來和別人同調(或說透過心靈感應來瞭解他人)。就如同「德爾菲Delphi」神殿，你是一個傳達神諭的祭司，可預見未來。<br>身為女祭師的「娜芙蒂蒂王后-Qucene Nefertiti 象徵你可以把各種抽象的感知帶到有形世界裡的能力。把心靈相關的這門技藝以務實深具影響力和通俗的方式運用出來。<br>保持沉著冷靜、平和、堅忍和抽離在你的超然客觀與脫俗中，你在情感上是獨立、自足的。擺脫那些可能會蔽你如鑽石般清澈洞察力的情感糾葛和世俗牽絆。<br>陰暗面或消極面:你可能因脆弱、冷漠及逃避現實。轉而尋求女祭師般的靈性和修行生活，以致於失去人世的温暖並迥避了涉險的機會。'
    },
    {
      name: 'empress',
      title: '皇后 Empress',
      // mean: '豐收',
      keyword: '九型人格第二型、母親、付出者。創造者、孕育者，守博者、比卦',
      text: '站在地球前面，皇后就是保護者。徵「維護」的法則。就像守護「國坦卡門-Tutankhamun」<br>法老王靈魂的埃及女神「塞克特-Sclket」象徵著你維持和守護生命精粹種子的責任。好讓它能永恆的開花。你可以重新創造、復甦和恢復生機。<br>身為皇后 你是個母親。就像大地之母。薪著繁衍來延續生命，你是個創造者。盡母職，培育妳所創造的並讓它開花結果。成為一個孕育者、供給者和付出者。你對生命所創造的寓物有無條件的愛，總是展開雙臂，慈悲且不批判的擁抱生命。身為女人和母親 你就是家和療癒者，集中與生成。富足和世俗的。同時你也是富與性感，美麗且深具引力。<br>陰暗面或消極面:你可能會將道些特質轉化成一種依附」，被家綁住的，估有慾強且讓人窒息的母親。'
    },
    {
      name: 'emperor',
      title: '皇帝 Emperor',
      // mean: '支配',
      keyword: '九型人格第八型、牡羊座、父親、領袖、建造者、成就者、晉卦',
      text: '皇帝，由「菲利消-KingPhilip國王」和他的兒子「亞歷山大-Alexander the Great大帝，來代表，象徵物質世界的發展法則。像個皇帝成為建造者。對世界的物質演進有所貢獻。<br> 身為父親和「牡羊座」，你是個先驅者。為自己和他人開創一個新世界。你的野心和抱負，驅動著你不斷朝新計畫和願景前進。成為一個鼓動者、調動者、創始者和行動者。受到名氣财富權力和影響力的驅使，你會在世界上成名。尤其是在商業和政治領域。<br>為了建立你的帝國，你擁有如老鷹般的清晰心智、如鯨魚般的情感實力(對情緒力量的掌控)、如公羊般的身體精力(生理能量)。為了明確達到你所設定的目標，就要有偉大國王們所擁有的領導力、毅力、果決力、膽色和組織能力。你是被強大的自我意識和競爭力。引领著你去赢得金钱上的富裕和專業上的認同。<br> 陰暗面或消極面:有掌控的需要，抱持著一家之主的權心態去支配，因而缺乏彈性且獨裁的。'
    },
    {
      name: 'hierophant',
      title: '教皇/大祭師 Hierophant',
      // mean: '援助',
      keyword: '九型人格第六型、金牛座、老師、智者、哲學家、禮儀者、謙卦',
      text: '教皇/大祭師，象徵「精通生命」的法則。要像個小孩般透過生命中的試煉來學習，透過經驗來成長，以達到佛陀的境界一完全覺悟(enlightenment)<br>佛陀赤腳站在地上，象徵著開悟之路就是得經由這些塵世間的功課:就像從堆肥中長出的花朵。它是經由生命中的雜亂物一暴風雨、裂縫和峽谷一脫蛹而出。把逆境轉化成機會，需要有佛陀般的深思覺醒一即是透過女祭司般的平靜來誠實觀察關於你的現實狀況或真相<br>就像佛陀，你已經是個精通許多試煉的智者。成為那個引領之手、眾人之師。如同大象清出一條道路。為他人開啟深奥且無限的生命根源之路。你是一個啟發者。如同金星、維納斯一清晨和榜晚顯露的那顆星光。仔細聆聽你内心的經驗之聲(以佛陀的耳朵來象徵)。<br>陰暗面或消極面:身為教皇/大祭師，你尊重古老的世界與其知識，但你可能會被傳統所牽絆而變得像「金牛座」般一成不變、化和教條式的。留意不要像公牛一樣變得怠情和安逸，只信奉那些空泛和徒具形式的舊有儀式與规矩。'
    },
    {
      name: 'lovers',
      title: '愛人 Lovers',
      // mean: '結合',
      keyword: '九型人格第九型、雙子座、夥伴、伴侶、溝通者、交際者、訟卦',
      text: '愛人，是以男人和女人的結合來表示，是「合而為一」的法則一「一體」即是透過緊密結合。<br>另一面而成的。它代表你和其他人的溝通，以及你自己内在兩極化差異的整合。作為「雙子座」的雙胞胎、二元對立的男人和女人、太陽和月亮、森林和沙漠、黑和白。以及撕裂的玫瑰⋯都象徵著相同性和差異性。<br>生命對你而言是不明確的，使你的中心經常保持在兩股對立力量的拉扯之中。要知道結合會創造分裂，分化會開啟了整合，融合和分裂是成對的。<br>你會不斷的面臨抉擇一選擇這個或那個。選擇涉入或不涉入。你可能會猶豫不决、困惑、而且有時會有點精神分裂似的。但在一片混之後 请晰就會随之而來。自在的去面對改變，愛人就是會擁抱相對的一面。在你和他人親密的連結時，也維持你自我的完整性。陰柔和陽剛兼顧。認清你的獨特性，但也在別人之中看到你自己。<br>陰暗面或消極面:就像石雕中的愛人互相緊密擁抱一樣，你可能會變得相互依賴，淪為關係中的囚鳥。'
    },
    {
      name: 'chariot',
      title: '戰車 Chariot',
      // mean: '勝利',
      keyword: '九型人格第七型、巨蟹座、探索者、熱衷者、激勵者、促成者、艮卦',
      text: '戰神以希臘的戰車駕御者為象徵，代表「行動」的法則。你的心智、身體、心靈和精神在不斷的行進，以邁向它們所能到達的最高造詣。你正在往前和往上。接受挑戰去探索所有可能達到理想的途徑。成為一個冒險家、旅行家、征服者和獵人。 <br>身為「巨蟹座」，你的背上就駝帶著你的殼或家。不管去到了哪裡都當作在家一樣。你的安全感就在你的内在。<br>戰神凝視的入神眼光，象徵在你的行動中讓自己保有内在平靜的靜觀、抽離能力和覺知。你的行動於是變得毫不費力且在改變中仍能穩住重心、不偏不移。<br>陰暗面或消極面:你可能像野馬般沒有自制的。追隨你所熱衷的或你的熱情，但對目標過度地執意和著迷你可能太用力嘗試且走得太快。因而可能會遭到挫折。鎩羽而歸。'
    },
    {
      name: 'strength',
      title: '平衡 Balance',
      // mean: '意志',
      keyword: '九型人格第一型、天秤座、仲裁者、思考者、協調者、既濟卦',
      text:'平衡是「行動和反應」的法則。每一個行動都有相對的反應。平衡「8」這個數字象在常態性改變中的平衡每個改變都會創造一個新的平衡一失衡。<br>平衡是一支舞蹈，像「天秤座」那樣連續不斷的調整心智來保有你的均衡。讓自己保持一個能夠適應且可通的頭腦。<br>由兩半邊相連的腦，象徵你左右腦的平衡。讓自己同時是善於分析和充滿創意的，通達數理及富有詩意的，理智與夢幻，果斷往前和靜下來省思。你的心思敏銳，就像劍和鑽石的切割面，能夠滲透問題的每個層面。讓自己像處於平衡狀態的「正義之劍般擁有評估所有利弊與優缺點的客觀性。(平衡在傳統塔羅裡是代表「正義」)。像法官般以公平作為行動基準，公平的對待自己的每一面向:你的心智(鳥)。心(杯子)，身體(球體)，以及靈性(舞者的伸展)。在關係中尋求平等。保持你生活的平衡。<br>陰暗面或消極面:你可能會過度的主觀批判和挑剔(那把劍就是利刃)。而你想要讓事情維持秩序的衝動，可能會讓你因而無法熱情的活出全方位的人生。'
    },
    {
      name: 'hermit',
      title: '隱士 Hermit',
      // mean: '尋求',
      keyword: '九型人格第四型、處女座、內向者、療癒者、神秘者、完結者、觀卦',
      text: '瑪雅的死神面具，象徵著隱士為了完成他/她的心靈修持和俗世的功課，把世俗的紛紛擾擾關在門外。隱士象徵著「完美」的法則。把功夫投入在結合物質與靈性的最高造詣以達到完整圓滿。<br>為了達成這樣的完美，在你內心的「處女座」隱士把健康(療癒之手)和收成(麥)帶到實體和物質生活裡，並成為心靈/靈性的殿堂。審慎的去處理那些會分散你注意力的事。以便完成你的計畫。要吃的健康(全谷食物)並有充足的休息(閉合的眼睛)，以協助自己達成目標。<br>探索物質上的保障與自給自足，好讓你可以向內進入到你的內在殿堂(山洞) 以獲得自覺並和神性合而為一。透過與高我連結，你把這股力量透過你的雙手帶出療癒、創造和引導。<br>陰暗面或消極面:你可能是個過度的「完美主義者」並變得和他人疏遠。你可能會因為感覺被遺棄而越來越退縮到自己的内心。你的隱居或獨處，非但沒讓你感受到復活力與過著富有啟發的生活，反而體驗到孤獨和乾枯、凋零。'
    },
    {
      name: 'fortuneWheel',
      title: '財富/命運 Fortune',
      // mean: '輪迴',
      keyword: '機會主義者、冒險者、企業家、慈善家、豐卦',
      text: '佩戴著「德勒斯登-Dresden寶物」的黑人象徵著「繁榮興旺」的法則。在知道如何接收由宇宙富饒之源來到你面前的大量機會時，你就會旺盛。<br>像個輪子一樣把這些慷慨輸入而來的機會，轉化為成果產出。要懂得把握機會並保有創業家的冒險精神。靈活的把負面與劣勢，轉化為正面與優勢。調整各種想法，轉個角度來看到出路。<br>像鬥牛士般的英勇和敢於冒險來掌握機會。你需要保持樂觀(以皇冠來象徵)。要像木星一樣，開闊的去思考並決定你如何把所有可用資源聚集在一起，以創造出協力與綜效。就像在「命運之輪」上的舞者，讓自己保持敏捷、靈活和警覺，隨時準備好行動。<br>你是持續地在回收運用宇宙的财富。透過給出你所創造的，以讓新的契機進來這樣的流動會為你和他人創造富足。<br>因著你的分享，你會在生活的各個層面上得到獎勵回報。<br>陰暗面或消極面:「財富之輪」心態是伴隨著風險性的你可能會有你是豪華顯赫的幻象:自以為了不起而得了「大頭症」。你可能會跌落深淵。你可能會被財富的誘惑所迷住而永遠沒有在靈性上成長，永遠不快樂，永遠不足夠一因為「足夠」對你來說，永遠都不夠。在你追逐财富的同時。你可能變得很會剝削和操控的。'
    },
    {
      name: 'justice',
      title: '力量 Strength',
      // mean: '均衡',
      keyword: '獅子座、外向者、表達者、炫耀者、感受者、大畜卦',
      text: '作為「獅子座」這獅子是統治者地位的象徵，力量代表「自我駕馭」的法則。力量一是對自我本質(being)自由和可控制(自我駕馭)的完整展現。<br>就像從混沌中帶出規律的「Shu-埃及風之神」的頭像所代表的，對你自己的心智保持駕馭。火一般的水池象徵著你對情緒的掌控在獅子脸旁的「手」代表著你有能力駕馭物質上的渴望和獸性般的慾望。「萬神殿Parthenon」象徵著你對這世間生活/生命的精關掌握。 支持卻不佔有的手，代表著讓你的各種特質有展現的自由 就像歌唱的鳥和盛開的花朵，不要害怕去表達自己與展現你的真我。要擁有獅子般的勇氣去做自己。 像半人半動物的臉，你可以戴上很多面具。讓自己保有多面性，成為多種角色的玩家。就像看似脆弱但又堅韌的蛋和蝴蝶，以「陰和陽」兩面來表達自己。力量一就是活得和你靈魂裡那個純真多樣的天性，完全一致。<br>陰暗面或消極面:你豐富的表達力可能轉化成虛榮、高傲自負和炫耀的。你的力量以及對掌控的渴望，可能會讓你變成是跋扈的，壓制的，和令人生畏的。'
    },
    {
      name: 'hangedMan',
      title: '倒吊人 Hanger Man',
      // mean: '犧牲',
      keyword: '奉獻者、教世者、忠诚者、自願者、逆轉者、需卦',
      text: '上下顛倒的「倒吊人」象徵「反轉」的法則。<br>像是被釘在十字架上的耶穌，勝利與成功總是與你的預期相反，透過投降與臣服去取代獨斷的行動和頑強的抵抗。讓他去吧!投降，認輸。<br>當你感到停滯、焦慮、絆住和困住時，去等待，按兵不動的等它結束。當你懸在其中，於卡住的狀態時需要你原地踏步。去接受你的限制，才會為你帶來拓展。<br>章魚的觸角代表你正處於局限、壓迫的影響下，這已超出你所能控制的範圍。放下你的自我，那種猶如你被溺斃和拖向深淵的感受，就是所謂的「心靈的黑夜」一但此時也是你獲得重生和新生命的準備階段，要有信心，相信你所離有的天賜恩典。倒吊人也象徵著慈悲的「自我犧牲」，就如同耶穌基督，為他人著想而自我奉獻，讓你能夠超越自我的層次並與宇宙偉大的靈魂合而為一。<br>陰暗面或消極面:會有絕望的傾向(頭垂下來)，自怨自艾(後牲者或烈士情結)，借酒澆愁去麻痺自己(破掉的杯子)或楼虐待自己(病奄奄的狗)。'
    },
    {
      name: 'death',
      title: '死亡 Death',
      // mean: '結束',
      keyword: '天蠍座、终結者、轉化者、釋放者、再生者、渙卦',
      text: '死亡是「無常」的法則。所有事物終究會結束的，接受他吧!死亡是一種隨順著自然、演進(蛇在蛻皮)、釋放(愛達荷蛇河流-讓水流釋出)、或放下(落葉)的狀態下而發生。猶如看似蠍子般的「新幾内亞祖靈」面具上像刀子般的鼻尖所象徵，死亡是可以透過切割一個無用、停滞或壓抑的事物過程裡去有意識的引發。<br>死亡可能會讓你感傷(憂鬱者雕像)，但最終它是讓人感到解放的死亡是一個帶來自由的過程，而該自由是以(開放的空間、清新的空氣、死海的空蕩寂靜)來象徵。<br>要留意你可能正被比自己還大的力量所吞噬並承認死亡這個心魔永遠都在，這是以陰森的祖靈面具和小螯蝦正被鷺鷥吞食來表示；要明白每個當下，都可能是最後一刻迫使你在當下能夠全然的活出來。<br>陰暗面或消極面:害怕死亡等同於不曾真正地活著。除非你願意面對死亡，否則你無法真正的去活。唯有願意放下。才能讓生命走進來，否則你會變得死板、僵硬和緊繃，那就真的跟死去沒兩樣了。'
    },
    {
      name: 'temperance',
      title: '藝術 Art',
      // mean: '淨化',
      keyword: '射手座、創意家、訊息傳遞者、融合者、編織者、睽卦',
      text: '藝術是以「雅典娜-希臘的藝術守護女神」代表，象徵「創造力」的法則，在生命的所有層面與人生所有努力的過程裡，你是個有創造力的藝術家。創造力是一種將舊有形體熔解，再重組成新綜合體的「煉金術」技藝善用你生命中那些未融為一體的部分來作為發揮創造力的機會。<br>你的創造力，是你各項才能相互交織、綜合運用的結果，允許像火一般的創造力靈魂來驅動你自己，它會由無意識處發出多道閃電，以構想和願景的形式，傳送到你的意識覺察裡。<br>你手中那如水般的感受，將決定你是否動手展開行動一這是實體自我的部分一去落實願景。這創造的過程是自動自我整合的，就像印地安人的編籃藝術，你把自己重建成充滿活力的完整個體。<br>作為「射手座」把你的想法、願景和產出，就像穿透的彩虹向外投射；向世人去溝通你自己和你的靈感。而你那富有創造力的表達，就像蘭花般將會影響這個世界。<br>陰暗面或消極面:這富有創意的煉金術士。可能會因著行動或創作過程中所帶來的興奮，因而偏向了不平衡。這種近乎成瘾的創造力，讓你進而忽略了内在省思、耐心、平靜和為人的許多本質。'
    },
    {
      name: 'devil',
      title: '魔鬼之樂 Devil\'s Play',
      // mean: '詛咒',
      keyword: '摩羯座、反偶像崇拜者、儀式主持人、原始主義者、背馳者、豫卦',
      text: '兩個「希臘酒神節」的表演者在魔鬼之樂裡，象徵「慶祝」的法則:這是一場慶祝「酒神奥尼索斯-Dionysian」的慶典儀式，表對生命以及辛勤努力的欣喜(魔羯座)、著魔(魔鬼舞者)和性愛上的愉悅(愛神-Eros)。透過歡笑，送走你的恐懼和悲傷。為你的成功乾杯，盡情的手舞足蹈，因為生命就如同「農神-Saturnian」所賦予的豐收一樣一旦你把酒釀好，就把它喝掉!透過激情和玩樂來振奮你的精神。透過一些娛樂或休養來重新創造自己。<br>透過酒(酒壺)、音樂(排笛)、改變心智的活動(蘑菇)，你變得不受拘束且更加大膽。在你破除舊習的過程裡(破碎的雕像)，你會看到跳脫世俗和社會規範的新出路。釋放你自己並回歸自然，即興和真實。<br>陰暗面或消極面:當然在酒迷心竅下，你是冒著如同落懸崖的風險，完全盲目的就像已遭到徹底滅絕的嘟嘟鳥，你恐會鑄下大錯。出於無知，你就會是魔鬼，要小心。'
    },
    {
      name: 'tower',
      title: '塔 Tower',
      // mean: '毀滅',
      keyword: '革命家、改革運動者、淨化者、催化者、革卦',
      text: '塔象微著「淨化」的法則。是一種對生命所有層面做一次革命性的洗滌。「印加-Inca戰士」從塔上跳落象徵著徹底清除在所有的不淨(黑塔)炙燒的肖像代表燒掉你的黑暗面，燒光那些不屬於你生命中的東西。<br>太陽在高塔上面的這個景色(目光觀望太陽)象徵著強烈的自我反省。看見你在思想上必須去摧毁的模式和信念(無頭戰士) 去看到那些你必須燃燒殆盡的負面情緒(肖像燃燒中的心)。去看見你須要排除的毒化物質或體内毒素(斷腿的戰士)。<br>去看到在世上你必須改變的處境和事件(破損的身體結構)去看到那些不是真正屬於你而必須犧牲的面向(祭火)。<br>藉由躍入煉金術士的熔爐，熔去你内在與外在的老舊結構。這場蛻變的發生伴隨著第一隻通報春天將臨的畫眉鳥來(紅翼的黑鳥-報春訊來象徵)，預報一個展新的黎明即將到來。而你藉此重整你的生命(在塔中的燈光)。<br>陰暗面或消極面:你可能缺乏戰士的決心而困在你的塔裡、你的結構裡。你可能缺乏勇氣去跳進一個激烈的改變中。或者你可能會把自己遇到的挫折或憤怒，投射在別人身上，因而擾亂到他人的生活。'
    },
    {
      name: 'stars',
      title: '星星 Star',
      // mean: '希望',
      keyword: '水瓶座、指標者、模範者、指路人、優美者、慈悲者、貪卦',
      text: '星星象徵著發光發亮的法則，像星星一樣的發亮。你就是那道光。自尊來自於接受自己就是那顆星。自我認可會帶來成就。當你承認自己的優秀特質時， 別人會把你視為一位傑出人物。<br>站在群星的揮灑下，你接收來自上天的啟發，你的頭部就在這群繁星之中去追循那些崇高、充滿想像、革新的、能啟發人心的想法。你是他人的燈塔。一盞指路明燈:協助他人，找到他們自己的星光(即與傑出的一面連擊)。<br>星星是以「觀音」來作為象徵。她如同「水瓶座」這擁有「生命之泉」者亦是宇宙的侍者。懷著慈悲注入你那能恢復生機的泉源及散發你的光到黑暗之中去滋養乾涸、荒蕪和貧脊。<br>陰暗面或消極面:像星星般你很漂亮去讓這個世界更加美麗。如果沒能看見自己的美，你的星光會是有距離和冷酷的。你變得昏沉恍惚，離你的光太遙遠而無法幫助自己和他人。'
    },
    {
      name: 'moon',
      title: '月亮 Moon',
      // mean: '不安',
      keyword: '雙魚座、感覺者、浪漫者、心靈相通者、女神、循環、恆卦',
      text: '月亮隨著他各個不同階段的月相所示，象徵「循環」的法則像月亮般允許自己去體驗溫和、穩當、漸進的改變。在這種連續性的轉變中自然會創造出新的開始；就像一個階段的完成繼而就會產生出另一個階段的開始，那樣的自然循環。<br>你猶如「愛芙羅黛蒂-Aphrodite-象徵愛與美的女神」那樣的性感和浪漫，讓你很容易吸引到别人。你可能會被浪漫的幻象所迷惑而陷入情感的依戀，不斷在其中打轉導致無法走出去。去完結舊的關係或舊有的相處模式，然後把他們帶進一個「阿波羅-Apollo」所代表的理智與邏輯被遮蔽在幕後。去傾聽你的月亮之夢要告訴你的事。像海豚一樣透過直覺與感受去知道事實。夜晚象徵你對潛意識層面裡的動機和驅動力的覺察。作為水和「雙魚座」以兩隻海隊來象徵。去感知人們的模式和循環週期。檢視你過往的生活。並覺察它們現在是如何影響著你。<br>陰暗面或消極面:你月亮般的敏感性、感受力和順從性。可能會導致你在情緒上反覆無常。你可能有些時候感到精钟失常；會經歷月圓時的豐盛感。到月缺時的沮喪感。你的感受看來好像失控。你可能會覺得在掌管自己的生活或打破自己舊有模式及停滯的處境，感到困難。'
    },
    {
      name: 'sun',
      title: '太陽 Sun',
      // mean: '生命',
      keyword: '源頭、能量供给者、現實主義者、行動者、組織者、要角、離卦',
      text: '太陽象徵「生命」的法則。生存就是具有生命力與行動力。要有朝氣、活力和積極，就像年輕的法老王「圖坦卡門Tutankhamun」所代表的旭日。你是清醒的。你的心智保持在高度覺察。你的身體是輕盈的，心情是開朗的。你的精神與靈性上是揚升的。你的財富如黃金般在成長。在你人生的生命之舞裡。成為一位全程投入的参與者。像光芒四射的太陽，你握有非常強大的力量及影響力。藉由散發你的活力來喚醒他人，透過你創造性的能量。你可以恢復青春活力並充滿精力。你就是生命力。<br>你如同著於社交且活潑的太陽，在工作上和別人一起共事和玩樂。透過結合自己與他人的能量，你創造出一個新太陽，一顆可以創造新生命而共同協力的火球。<br>陰暗面或消極面:你活潑外放的天性可能會導致你忽略了內在的自己。你在活躍的生活中也許忘了往內自省、休息和靜下來你可能會被自己大且過度活的火球力量所蒙蔽與佔據。因而過度耗盡你的精力，導致自己或他人感到心力交瘁。'
    },
    {
      name: 'judgement',
      title: '時空 Time Space',
      // mean: '復活',
      keyword: '先知、遠見者、構想者、巽卦',
      text: '時空在塔羅傳統裡被稱為「審判Judgement」或「永恆-Aeon」，以「阿茲特克Aztec的春之神-希培托泰克Xipe-Totec」作為象徵。祂以身被獻祭者的人皮，代表面對舊有因果業力模式的死亡之審的新生命(意喻檢視過去並獲得重生)。正如三尊佛像判官所象微，現在是時候透過客觀和敏銳的自我評估來對你自己執法。<br>業力的法則，是一切法的定律並以時空作為象徵，意喻透過你超時空的視野，你可以觀看到你的思想和行為模式之間的因果關係。一連串的岩石碑、太陽和月亮的連續畫面，代表著你有能力去看到你的過去如何成就了現在，而現在又會創造出怎樣的未來 透過你的慧眼，去改變未來，進而讓自己的業力轉向。日規所組成的方向盤，代表著你了解你是誰和你要去哪裡就讓自己像飛行員、鳥、冥想者和探測大空梭一樣，在思想上進行異乎尋常的跨時空飛行。<br>身為一個意識層面的旅人，你可以超越物質世界進入到思想的任一地方、任一時間點。你是個未來學家和預言家；你的遠見和想法，是可以令到他人改變思維及觀念的種子。<br>陰暗而或消極面：你也許會有完全活在你自己思維裡的傾向。你抽離並且無視你在生理和塵世的需要與職責。你未能讓你那感知力的天賦紮根。'
    },
    {
      name: 'world',
      title: '宇宙 Universe',
      // mean: '達成',
      keyword: '圓滿者、多工者、多面精通者、大師、未濟卦',
      text: '宇宙象徵「通用」的法則。你就是宇宙，就像中心的石頭，你的内在擁有一個充滿多樣可能性的宇宙。你心眼所見之物都存在。像米開朗基羅一樣，把你自己塑造成任何人事物。一朵花、一座城市、一位神、一顆星星。放膽去試！去做吧！ 就像這颗石頭，你是完整且完美的；但也如同那未完成的雕像作品「覺醒的巨人」，你的生命是一個未完成的過程。總是一直在成形的狀態裡，你是同時在完成和起始中。<br>當你變得更有覺知(鑽石眼)，在情感上表達豐富(花)，並按自然規律重生時(鑿去舊有的石塊)你内在的宇宙就會漸漸浮現。藉由死亡和再生，重新打造你的生命或生活並為你自己建立一個充滿新人與新地方的宇宙。 <br>陰暗面或消極面:你的問題是下一步要怎麼走?要做些什麼？你被各種可能性給塞爆。在困惑和猶豫不決下，你變得寸步難行。就像石頭，你變得僵硬和卡住而無法改變。'
    }
  ]

  const minorArcana = [{
      name: 'aceCups',
      title: '聖杯王牌 Ace of Cups',
      mean: '狂喜 Ecstasy',
      // keyword: '感覺完整，同情，強烈的直覺，創造力，寬恕',
      text: '狂喜是一種超越一般性喜悅狀態的情感體驗，有如在天堂的花園裡被神聖的白光所籠罩的感覺。彩虹般檳粉的色彩、芬芳和優美的花冠描繪的是極樂，得意和喜悅的心情。你脫離了實際，仿佛置身雲端，倘佯在花杯之中而飄飄然。流動的瀑布代表著你在情感上的豐沛。随其满溢的想與他人分享你的這股豐盛。盛開的花朵指出「巔峰」體驗--轉瞬即逝的本質。但不管如何就享受這被赐與的恩典。'
    },
    {
      name: 'twoCups',
      title: '聖杯二 Two of Cups',
      mean: '均衡 Equilibrium',
      // keyword: '相互吸引，愛，合作，支持，培育，和諧',
      text: '杯子作為一個容器象徵你的情緒管理，它帶來情緒上的平衡。情緒上的穩定性就做河流，意謂著隨順感覺的自然律動而流。然而，處於人生之流中，尤其當卡在那些憂鬱，意外轉折和深陷泥沼的時刻，就更要像鴨子造型的花盆那樣，漂浮在這片情緒的水域之上。這種境界需要心智和身心達到沉靜的狀態，既成為感覺又跳脫你的感覺，並且不帶任何批判的，確認它們的存在。 均衡源自於情感上的自給自足，你内在所蘊藏的情感生命力，允許你在最寒冷的時刻成為陽光(黄花)即使在最乾燥和充满荊棘的環境裡，山脈上總有水源的集水區和在開花的仙人掌，這象徵著你内在的生命之泉。維持你情感的分界線。並在情感上自給自足。'
    },
    {
      name: 'threeCups',
      title: '聖杯三 Three of Cups',
      mean: '愛 Love',
      text: '愛，有如粉紅的玫瑰。是你心中的展現。鸚鵡螺和盛開的花朵也象徵愛，在愛裡坦然的付出自己的愛(傾倒的杯)和接納别人的愛(接受的杯)。冒著可能會受傷的風險。愛一是你内在裡那充滿活力的男人與善於接納的女人的結合。愛鼓勵著你去和其他人、和自己的每個部分、和道個世界一起交流互動，猶如花朵般綻放。愛也是促使你與其他不同的人能夠建立起社群的黏著劑，這是透過融洽交流的鬥魚來象徵表示。'
    },
    {
      name: 'fourCups',
      title: '聖杯四 Four of Cups',
      mean: '憤怒 Anger',
      // keyword: '冥想，沉思，無靈感，冷漠，自我分析',
      text: '情緒和杯子一樣脆弱，你是會破裂並爆發的在憤怒中你的杯子被拌得粉碎。在你内在衝突裡，你看見紅色並變得像暴風般滿是泥濘的河流一樣激怒。當你丟出情緒、大發牌氣時，你變得咄咄逼人。你就像長滿刺的仙人掌那樣的自我防衛 情怒是你在通往山頂時摔了一致，但道股火熱的怒氣也可以轉换成正面的能量並再次激勵你站上新的高峰。允許你的情怒以非暴力的方式宣洩出來，則你將會被復原和轉换。把你的慎怒導引成創造力。'
    },
    {
      name: 'fiveCups',
      title: '聖杯五 Five of Cups',
      mean: '失望 Disappointment',
      // keyword: '痛苦，疼痛，情緒不滿，突然喪失',
      text: '失望是随著我們在情感上緊抓不放的期望未達到 而引來的理想幻滅(枯券的玫瑰)和夢想破碎(破碎的杯子和貝殼)的組合。這個空虛的結果(空杯子)，引發憤怒(破碎的玻璃杯和碎浪)、悲傷(翻倒的杯子)、恐懼(封閉的杯子和黑暗沼澤般的水)和停滯/沮喪(發霉的老舊杯子)。失望是學習活在當下的现實中而不是活在未來幻境裡的一堂課。中間被泥土覆蓋的罐子象徵回到現實。放下你的情感依附，並認清事情會按某種方式發展有其更高字宙層次的目的。接納一切，失是一個沒達到的約定，放手吧。'
    },
    {
      name: 'sixCups',
      title: '聖杯六 Six of Cups',
      mean: '悲傷 Sorrow',
      // keyword: '團圓，懷舊，天真，舊時的回憶，嬉戲，知足',
      text: '翻倒的花瓶代表傷悲，黑暗的淚河和悲痛的紫花，象徵你在經歷逆境、期望落空、生離死别後所感受到的悲傷，你落入情緒的深滑並被打擊到沮的谷底(乾枯、破舊、發的土瓶)當你允許將悲傷傾吐出來時，這也是個情緒抒發和淨化的時機。 勇敢的去擁有悲傷，花瓶裡的光和其側邊的棕格樹圖案象徵你情緒上的復甦。當你願意釋放和放下，將重獲生命與活力，同時也深知一切都必將逝去。'
    },
    {
      name: 'sevenCups',
      title: '聖杯七 Seven of Cups',
      mean: '恐懼 Fear',
      // keyword: '不良的時間管理，突然的思維，多項選擇，逃避現實，錯誤的希望，傻瓜的天堂',
      text: '水流和令人噁心翻滾的浪潮，伴隨著驚恐、焦慮、擔憂及恐怖，這些象徵恐懼。當感到害怕時，你封閉和起來(封閉的瓶子)，並變得孤僻和面無表情的。你開始看見或虛構出食人魚、獅子、昆蟲、海怪、佈滿密刺的仙人掌、鬼鬼崇崇的人、蛇和海嘯。你逐漸變得恐懼與偏執，蘭花化身為攻擊怪獸，你的恐懼被埋在你的潛意識裡(海底)並自行顯化成惡夢和夢魘。 如同處理憤怒一樣，你可以把恐懼的紅色腎上腺素轉换成能量警覺心及行動。大香爐象徵著你凝聚勇氣並將恐懼燻出，當然，這還有健康上的顧慮，所要學習去分辨。要長就得走進你的恐懼裡，去感受它並無論如何的去做恐懼的另一面則是財富。'
    },
    {
      name: 'eightCups',
      title: '聖杯八 Eight of Cups',
      mean: '停滞 Stagnation',
      // keyword: '沮喪，逃避現實，放手，旅行，自我分析，退縮，情緒強度',
      text: '停滞是你在情感上感到疲勞、怠惰和乏味，這是當事情開始走下坡，變得像沼澤般膠著(沒在流動的水)、凍結的(結冰的水)、乾枯(泥灘)、令人空息的(淹死的花和封閉的瓶子)和死氣沉沉(落葉和不堪使用的杯子)時所出現的現象。花卉圖案上大量溢出的液體象徵著你因為過於疲勞、放縱用藥過度和沉溜酒色所經歷的停滯。不堪用的杯子、乾掉的樹葉和水，代表一成不變和枯燥乏味所帶來的停滯。中間封閉的花瓶代表是時候讓你的情感休息了。透過停下所有的系統省下精力並深入自己的内在，你將會恢復活力與精神--花瓶上春天的綠意就象徵這個過程。謹記所有的生命都會在困境中破繭而出。所以要有耐心並理解新生命正在形成。'
    },
    {
      name: 'nineCups',
      title: '聖杯九 Nine of Cups',
      mean: '滿足 Fulfillment',
      // keyword: '實現願望，知足，幸福，慰藉',
      text: '滿足是指在完成和達標後，情感上感到滿意與知足的狀想(數量多且裝滿酒的玻璃杯)以葡萄釀成酒、水果製成蜜、種子長成到開花。作為豐收的象徵，這也是實現和達成你內在豐盛與天份(你內在珍藏的明珠)的結果。裝滿酒的酒杯，象徵對你工作的肯定並慶祝你的豐收。為你的成就乾杯，以你的成功為榮，並享受你努力後所帶來的成果。'
    },
    {
      name: 'tenCups',
      title: '聖杯十 Ten of Cups',
      mean: '熱情 Passion',
      // keyword: '精神啟蒙，歡樂，感恩，理想主義，感覺完整',
      text: '火紅的花朵象徵你的熱情，你很激動、興奮、活力充沛並且能量飽滿。在熱情的燃燒下，你被強烈的慾望和渴望所驅使:獅子的舌頭顯示你非常渴望得到且已經到了幾乎可以嚐到它的地步就像獅子和野花，狂熱的去追尋愉悅。獅子座的容器與向外投射的花朵，代表你在情感上善於表達。別害怕去展現你的感受。有力量、自信、強而肯定、勇於活出你的多采多姿和不可思議！'
    },
    {
      name: 'pageCups',
      title: '聖杯小孩 Child of Cups',
      mean: '感受者 Feeler',
      // keyword: '藝術的，熱情的，感動的，深情的，樂觀的',
      text: '在情感表達上就像是小孩或花朵般開放、敏感和誠實。忠實和即興的去表達你所有的情感:快樂與悲傷、熱情與沮喪、恐懼與興奮、驚喜與憂愁，像是曇花一現的花朵和流動的河流，你是迅速經過川流不息的各種感受。你是情感上的疾風俠。在極少或不去壓抑你的感受下，你會發現你情感上的廣度和強度，你連結上你最深層的潛意識動力，你全然並真正的感受到活著!'
    },
    {
      name: 'knightCups',
      title: '聖杯智者 Sage of Cups',
      mean: '更新者 Regenerator',
      // keyword: '提煉，進取，善良，樂觀，興奮，靈活',
      text: '作為一位更新者及恢復者，你在情感上富有創造力。像是滋潤生命的及時雨，你可以將不毛之地轉變成情感豐盛與愉悅的花園，你内在的青春之泉，創造新的情感生活與生命力。你是個治療者，就像冒泡、淘氣的水，你能透過歡笑和愉悅這種復甦的力量帶歡樂和喜悅，你的能量是一座良藥之泉，它能治實際已經傷痛和困擾糾結的心。'
    },
    {
      name: 'queenCups',
      title: '聖杯女人 Woman of Cups',
      mean: '欣喜者 Rejoicer',
      // keyword:
      text: '你就像貝殼、蓮花和杯子般善於接納生命，讓生命的美麗充滿你的心。去聆聽(耳邊的海螺)、去品嚐(杯中的月亮)、去觸摸(皮膚上的水珠)、去聞聞生命愉悅的本質。你深受生命波濤起伏和浪潮來去的感動，如同深海般深厚的感受，明智審慎(水)却又不失自然的表達。透過頌揚愛、崇敬和喜樂來展現你對生命的感恩。'
    },
    {
      name: 'kingCups',
      title: '聖杯男人 Man of Cups',
      mean: '衝浪者/駕馭者 Surfer',
      // keyword: '智慧，外交，寬容，平衡，創造力，自我理解',
      text: '你是個衝浪者，你從乘駕危險和挑戰所帶來的情緒浪頂中感到激動和興奮。由「色雷斯-Thracian領航者」的馬身角杯，象徵著你身為一個刺激追尋者所展現出來非比常的勇氣。控管你的情緒，以至於你不會失去平衡。要慎重和懂得區分--選擇去乘駕哪種情緒浪以及該放掉哪些。當你乘坐在人生情感的雲霄飛車時，保持你的冷靜。'
    },
    // ---
    {
      name: 'aceSwords',
      title: '水晶王牌 Ace of Crystals',
      mean: '聰穎 Brilliance',
      // keyword: '未使用的力量，精神集中，勝利，正義，誠實，智力，做出正確的決定',
      text: '王牌象徵單純的意識轉化為想法，陽光四射般的黄水晶代表你心智上的覺醒，在當下一個深刻的洞見：「啊!豁然開朗，頓時明白了」一你正在穿透象徵著未清醒和困惑的黑暗與雲層。你猶如微石般閃耀的卓越構想。為他人帶来一道深具啟發、清明、振奮和革新的光芒。你與生俱来的才華已然展現。相信你獨特的天赋並從中去創造。'
    },
    {
      name: 'twoSwords',
      title: '水晶二 Two of Crystals',
      mean: '平靜 Equanimity',
      // keyword: '冷靜，調整，避免對抗，公正，客觀思考，灌輸情緒',
      text: '水晶有鑽石般的硬度。這種無法穿透的特性就像沉著平靜的心智，無法被攪亂且經得起崩解的考驗。平靜是自我覺察的結果，這個覺知力以藍寶石之眼來作為象徵。女祭司般的藍色和冷色系的藍寶石代表著維持一種抽離、不帶批判的覺察。平靜的覺察意味著從一個距離外來觀看。凌駕於你生活和思緒的混亂及困惑之上，唯有道樣你才會變得平靜--客觀且實際。就像置中分為兩等分的藍寶石一樣，安住在你的中心，維持平衡與臨危不亂的狀態。'
    },
    {
      name: 'threeSwords',
      title: '水晶三 Three of Crystals',
      mean: '創造力 Creativity',
      // keyword: '令人不快的分離，痛苦，拒絕，心碎，孤獨',
      text: '水晶象徵你在思想上充滿了創意的特質。透過水晶來觀看就如同是透過心智來看世界，不同的觀點被創造，新構想因此而生。把水晶和你的心智一轉，則另一個看世界的新觀點就會浮現。 抽象且尚未成形的水晶物質。象微你內在正醞釀並等待著誕生的構想。突出地面的碧璽。代表著和這些構想的頭搭上線。就讓新的構想浮現。你的創造力是兩個不同構想或是你的天賦跟外在影響刺激下交會而成的產物。新構想的衍生是要靠開放、寬容和接納新的輸入才可行的--以圓形的水晶卵来表示，發揮創造力去思考。'
    },
    {
      name: 'fourSwords',
      title: '水晶四 Four of Crystals',
      mean: '邏輯 Logic',
      // keyword:
      text: '水晶就像心智一樣是由許多不同的面向所組織成一個整體。水晶和心智都有其内部組織和邏輯。讓你可以把原始未經整理、具有創意的構想，化為合理的模式與架構。把構想做有系統的整理。讓你自己是全面化且有邏輯性的去思考。看見事物之間彼此的關聯並做出分類。看到重點並決定優先順序。善用你的判斷能力去評估和判斷，運用你的理智和理解力来做出抉擇。'
    },
    {
      name: 'fiveSwords',
      title: '水晶五 Five of Crystals',
      mean: '負面性 Negativity',
      // keyword:
      text: '心智擁有水晶般的鋒利特性。你心智的銳利度是可以削弱、扼殺和否定的。像是破碎的水晶。你的負面思想是失敗主義取向並善於批判的。你會抱持著負面的角度去詮釋事件。以致到處都看到了龍捲風、山谷、洪水和地震。你的負面性創造了混亂(雜亂無章的水晶)狭窄的心时(暗沈的水品)，沉悶(不透光的水晶)和幻覺(愚人金/黃鐵礦)。 但這個負面性思維同時也賦予你斬殺自己負面性的能力。正面的去運用負面性。拒絕那些讓自己感到挫敗的內在自我評判。並且當你的分辨能力適時做出拒絕的判斷時，你得學習去說不。'
    },
    {
      name: 'sixSwords',
      title: '水晶六 Six of Crystals',
      mean: '困惑/迷惘 Confusion',
      // keyword:
      text: '想法在腦袋裡就像各種不同的水晶。他們自然生成各種不同的形狀、大小、顏色和質地。你的腦袋塞滿了各種讓人振奮的點子。它們的豐富多樣性，導致你思想上的衝突和躊躇不前。在無力去組織和理解這片混亂下就導致了困惑。不過，在這一片混亂想法的相互作用中。具有創意的洞見可能會浮現。接受這些想法意見和觀點的爭戰。因為清晰會在衝突之後到來。心智裡不斷生成且無法控制的構想。其豐富性和美麗是會讓你迷失的誘惑。你用腦過度了，別再困在你的腦袋裡了。'
    },
    {
      name: 'sevenSwords',
      title: '水晶七 Seven of Crystals',
      mean: '沉悶/單調 Dullness',
      // keyword: '不負責任，違反規則，害怕面對現實，隱秘的本性，獨自工作的願望，不忠誠',
      text: '心智猶如水晶也能變得像岩石般的沈重。緊密且沒有光澤，心智的沉悶是因為你在思想上缺乏好奇心、一成不變，無法讓你的想像力翱翔，並且封閉了來自外界的想法和靈感。沉悶是當你覺得被堵住時的心智狀態。開放，去看看四周，重拾你的好奇心。沉悶也是心智的安全閥：當你覺得疲憊和困惑時，它會關閉你的思路，藉以放鬆你的大腦，而沉悶也可以是很平凡、務實的思考方式不須那麼的引人注目，只需很實際即可。'
    },
    {
      name: 'eightSwords',
      title: '水晶八 Eight of Crystals',
      mean: '綜合 Synthesis',
      // keyword: '分居，監禁，害怕失去，缺乏信任，限制，做出錯誤的決定',
      text: '水晶具有多面的特質，象徵你在心智上也擁有諸多功能面，就像水晶的整合結構。你能夠融合多種不同的構想及思想特質。中間的水晶代表胼胝體，是連結右腦創造力(看似有機的水晶)及左腦理性(切割過的鑽石和計算機)的腦組織讓自己同時是藝家和科學家，既充滿詩意又有邏輯。你被賦子了思想上的和諧、平衡及均勻。'
    },
    {
      name: 'nineSwords',
      title: '水晶九 Nine of Crystals',
      mean: '狹隘 Narrowness',
      // keyword: '不值得，過度敏感，極度焦慮，痛苦，恐懼，失眠',
      text: '水晶堅硬及不可貫穿的特性，雖然被賦予堅定及力量，但也是被孤立的。同樣的，你的心智可能已封閉、孤立及無法變通。以水晶代表的柵欄，象徵你對自己思考上的約束。固定不變且偏狹，你保持著用一個狹隘心智的隧道視野來觀看世界，這是以縮小的隧道跟洞口來表示，把心智的範圍縮小是專注的要件。保持你的專注力並深入主題。保持透徹而不被擾亂。'
    },
    {
      name: 'tenSwords',
      title: '水晶十 Ten of Crystals',
      mean: '幻覺 Delusion',
      // keyword: '悲劇性的失落，背叛，難以處理的問題，感覺無用，新的開始的可能性',
      text: '就像合成水晶和人造鑽石，心智是會被朦騙而看到不存在的東西，就像以為看到的是鑽石而不是玻璃。你的心智在創造幻覺，讓你看到了海市蜃樓，看到高掛在天空中的假太陽和鑽石。你只看到你想看的，因而讓你容易產生不實的期望、宏偉的假象或自以為是救世者的想法所侵蝕。然而，你的空想和幻覺讓你成為一個富有想像力、有遠見的夢想家跟随你的願景和夢想，並且記住所有偉大的想法大都無法被多數人所理解，而且會引發平凡人的反對聲浪。去看看你的想法是否富有想像或是會帶來財富，去冒險吧。'
    },
    {
      name: 'pageSwords',
      title: '水晶小孩 Child of Crystals',
      mean: '學習者 Learner',
      // keyword: '不安，好奇心，熱情，健談，機智，間諜',
      text: '水晶洞穴是個讓富有好奇心的人去探索的神奇之所每種水晶都是值得細究的新構想。就像個小孩一樣，從探索新構想中去學習。心智本身就像個水晶洞穴。裡頭的小孩象徵你在自己的心智洞穴裡。去探索著關於心智運作的方式力量與其陷阱。檢視你的信念並穿越那些放掉舊制約觀點的恐懼--這些受制約的舊觀點，就像一張安全毯子般緊緊得包住你、阻礙著你往前。建立起可以為你帶來成長和擴張的新價值觀和觀點。透過像小孩那神奇與魔法般的眼光來看世界。'
    },
    {
      name: 'knightSwords',
      title: '水晶智者 Sage of Crystals',
      mean: '智者 Knower',
      // keyword: '教條，快速移動，多任務處理，戰鬥機，問題解決者',
      text: '你的心智就像歷經萬年之久所形成的水晶，是一顆帶著過往所學知識總和的水晶球。這樣歷史般長遠的角度賦予你「先見之明」的眼光。你看見整體並且可以預見未來的趨勢。你廣闊的視野使你能夠連結和整合，進而創造出新觀點。你也擁有技能與訣竅。你知道你的能耐，扮演一位指導者去貢獻你的知識和智慧給這個世界。你知道如何將尚未成熟的觀念，精煉成具有實際價值的想法並加以應用：這是以水晶球經由被切成有價值和重要性的鑽石來表示。'
    },
    {
      name: 'queenSwords',
      title: '水晶女人 Woman of Crystals',
      mean: '守護者 Guardian',
      // keyword: '智能，專注，專業，組織良好，智能化',
      text: '心智就像水晶，美麗而豐富但也因此容易被剝削利用。像水晶女人般守護著心智，也是你最重要的天然資源。賦予心智像鑽石般的堅硬與堅實不摧的特性，來保護他免於受到困惑、幻覺、失敗主義、沉悶和狹隘…這些負面想法的入侵。像水晶女人，保持著對你心智的掌控。訓練它。持續留意它的運作，你能夠任意的讓它轉向和專注。去冥想吧。 水晶也能治療。你是個治療師和諮詢師，一個心智的療癒者。你為自己和他人帶來思想上的健康。你能夠把你直覺所看見的透過言語表達出來。信任你直覺的運作邏輯。'
    },
    {
      name: 'kingSwords',
      title: '水晶男人 Man of Crystals',
      mean: '創造者/發明家 Inventor',
      // keyword: '公平判斷，專業，聲譽，成熟，冷漠，公開禮貌',
      text: '就像那產生新概念的水晶，你的心智發明了新構想和知識。允許自己就像科學家那樣去體驗一場心智上的創意大爆發。水晶男人象徵著你的構想在科技上的多種應用，就像水晶有令人意想不到的多樣化用途。你同時是技師和科學家，如同水晶所做的一樣，透過實用的發明和創新來改革你的世界。讓自己去腦力激盪。玩出新的點子並允許它們在你腦中的太空實驗室裡翻轉。'
    },
    // ---
    {
      name: 'aceWands',
      title: '權杖王牌 Ace of Wands',
      mean: '明朗/通透 Illumination',
      // keyword: '動機，新的開始，能量，創造力，在生活中前進，自信，成功的潛力，良好的表現',
      text: '權杖王牌的光束象徵明朗通透:一種洞察力、啟示，靈光一閃的洞見。這隻手意著你已經觸碰到一個真相，你已經看透事實的表面。明朗是革新和淨化的火炬，揭露真相無可避免的會帶來改變，所以能夠燒毀舊有的模式、特質及外在的環境。通透下的織熱光線是啟動你拙火的因果，拙火是產生靈性、性能力及生命力的能量基礎。你手中握有這束光，一股啟發與激活的力量，因而能轉化自己和他人，並使其能量充沛。'
    },
    {
      name: 'twoWands',
      title: '權杖二 Two of Wands',
      mean: '純淨 Purity',
      // keyword: '創造力，強烈的心態，未來的計劃，進步的思想，快速的決策，原創性',
      text: '白色的燭光象徵純淨。像無汙染的白雪及無瑕疵的白蓮，你未受到性格上不純潔的汙染。純淨猶如蠟燭的自然燭光，意謂著真誠和自然--誠實的面對自己而不受外在條件的汙染。白光、水晶、窗戶和建花的反映代表覺察上的純淨。不被先入為主的偏見所蒙蔽，看見事物真實的樣貌。純淨的白色能量。意謂過著無人造興奮劑、化學製品和藥物的生活。純淨的你是使別人看見他們自己道路的一扇窗，成為一道指引之光。'
    },
    {
      name: 'threeWands',
      title: '權杖三 Three of Wands',
      mean: '慈悲 Compassion',
      // keyword: '活動，準備，前瞻性思維，發展，領導，全局展望',
      text: '你的手就像佛陀完美的黄金手印，是帶著慈悲與金黃色光芒的權杖，心懷慈悲是指擁有佛陀般的同理心、諒解和寬容。如同手上停有蝴蝶這個圖示所象徵，你善於接收且能夠接納自己和他人。像柔和的夕陽，透過手掌的夕陽光芒所散發的溫暖，你擴大這個治療並賦予生命的能量，這是以療癒家奥加·沃勒(Olga Worall)温暖和神奇觸碰的紅色氣場照來表示。用愛的能量來療癒。'
    },
    {
      name: 'fourWands',
      title: '權杖四 Four of Wands',
      mean: '抱負 Aspriration',
      // keyword: '和諧，社會聯盟，慶典，強大的社區，溫馨的環境，新的機遇',
      text: '這隻手，象徵向上移動的火炬，代表你對實現你最崇高的理想與最大潛能的渴望。像尖塔一樣往高處。像手、尖塔和紀念碑突出於地面一樣，你的靈魂是無法被禁錮的。解放自己，讓你能自由地成為所有你想成為的人透過你擴張及活躍的火能量，伸出手去拿到你的目標。用你的拳頭去擊碎障礙。用專注和意志力來突破抗拒，以明朗通透和純淨的火炬去燒掉沉重的障礙。往前及往上前進吧。'
    },
    {
      name: 'fiveWands',
      title: '權杖五 Five of Wands',
      mean: '壓抑 Oppression',
      // keyword: '爭議，鬥爭，競爭，緊張，自我衝突，怨恨，活動',
      text: '網、圍籬、腳鐐、手拷，陷阱和繩結都是壓抑的權杖。身處栅欄之後。你無法看清及完全看見。同時你被你自己的誤解所壓抑。像是已熄滅的燭光和發生日蝕的太陽，你身處在黑暗中無法去察覺和看見。覺知上的阻斷，禁錮了你的心智，凍結了你的情感，束縛住你的身體並且銬住限制了你的活勤。在困住之下，你的靈魂開始崩裂和腐敗。你需要用新的觀點去看見自己及自己的處境。開放你的心智--讓你從那些狹隘、限制性及負面的觀點中釋放出來。別感到絕望，除非經歷過束縛，否則你不會明白自由。就正向積極面來說，這些柵欄與限制意著維持你的專注力及紀律，以便依能完成你的工作。認清你的局限並和自己在一起。'
    },
    {
      name: 'sixWands',
      title: '權杖六 Six of Wands',
      mean: '信任 Trust',
      // keyword: '勝利，達到頂峰，幸福，驕傲，進步',
      text: '光是信任的象徵。在光明之中我們信任。我們跟隨那道光。紅色燭光是象徵對血綠關係上的永恆忠誠，這是你對家族家庭的信任。手圍成的圓圈，象徵人類的社群及所有生命更為廣大的社群。在認知到我們都是一家人。去信任其他人及保持忠誠，像孩子一樣，看到他人的善良而主動保持信任。像成人抱住孩子一樣，要負起責任及值得信賴。在你的允許下展開友誼、合作、婚姻、聯盟、協議及合約關係。 信任宇宙，這是以跳傘者和上帝之手支持特技演員的生命之環來展現。要知道宇宙從不會給你無法處裡的事物。你是受支持的。往外伸出手。最重要的是信任自己，由緊握在一起的手來象徵。'
    },
    {
      name: 'sevenWands',
      title: '權杖七 Seven of Wands',
      mean: '勇氣 Courage',
      // keyword: '改變觀點，完成，耐心，保護，控制行為，感覺不堪重負，競爭優勢',
      text: '光代表勇氣，他可以直接照進黑暗中。雷射光劍、戰斧和刀的權杖，象徵你擁有戰士能量的那股勇氣，這樣的勇氣可以切開並看見你的恐懼及黑暗面的真相，阻止並驅除它們。圖騰柱、面具及彩色玻璃窗不僅僅代表你的恐懼--内在的惡魔--也代表你能克服它們的力量和勇氣。你的恐懼也可以成為你的盟友，如果你正視它們並把它們消除--之後它們就會站在你前面化身成那些想要壓迫你的人和勢力到來的一種警示。'
    },
    {
      name: 'eightWands',
      title: '權杖八 Eight of Wands',
      mean: '和諧 Harmony',
      // keyword: '光明的未來，社會化，運動，快速變化，行動，學習意願，旅行，快速決策，積極的新聞',
      text: '光是顏色的光譜，如同彩虹七彩光芒的和諧樂器能奏出和諧之聲，也是創造和諧能力的權杖。竹子是陰與陽的調和，所呈現的綠色(紅色及藍色的調和)也代表權杖的意思。它們象徵你把不同與對立的事物橋接起來，使其變得和諧一體。和諧是「中庸之道」的權杖。中間那條路。藉由居中和穩定的能量，你可以看到最直接的解答及夥伴關係。一同工作一起把事情解決，共同協力合作。尊重多樣性的和諧。你是橋梁，中間人、提供解答的人·去計畫、指引、整合及協調。'
    },
    {
      name: 'nineWands',
      title: '權杖九 Nine of Wands',
      mean: '誠信 Integrity',
      // keyword: '信心，保護，勇氣，耐心，耐久性，堅定性，調整',
      text: '你擁有誠信，像光一樣永恆且不停止運作的本質。誠信是由許多美德(以各種不同的權杖來象徵)所組成並一起運作讓你成為實在、堅強和可靠。把事情完結和完整的做完。聖殿象徵尊重和神聖化你的光，也就是使其聖潔所必要有的自重，誠信代表著遵循你自己的道路(路徑)，不害怕獨處(單獨的人像)，守住那些你不會妥協和退卻的理想與價值觀(尖塔)，有骨氣的為你自己和你的信念站出立場(脊椎)。像穿過雲層的高山，誠信就是開放、誠實、不虛偽。這意謂著要像摩天樓一樣站得直立和高聳。石頭象徵即使在外界令人不快的影響下，也無法擊破你不可侵犯及無法滲透的特質。用戰士般的決心去捍衛你的誠信。'
    },
    {
      name: 'tenWands',
      title: '權杖十 Ten of Wands',
      mean: '成長 Growth',
      // keyword: '工作導向，責任，疲憊，成功，壓力，容易上當，過度負擔',
      text: '如同大樹朝向著光前進一樣，當你擴張和伸展你自己進入到光時也讓自己成長。樹也代表權杖，象徵著你在意識上的成長和展現。就像樹會往下扎根生長，去發掘你的根源，深入到黑暗中(潛意識和過去)以及進入到地底層(人類最初共有的集體潛意識)正在逐漸增粗且開枝的樹。象徵著你在現實生活中的拓展。以及你對你每日時運的了解。樹同時也向上生長。代表著你在靈性上的拓展、你達到更高層次意識的境界，以及對未來知識的理解。經由成長，你像玫瑰花般的綻放，像星星般的閃耀，像紅杉巨木般的高聳。現在是時候往上移,去突破與開枝散葉了。'
    },
    {
      name: 'pageWands',
      title: '權杖小孩 Child of Wands',
      mean: '追尋者 Seeker',
      // keyword: '決心，發現，分析，非正統，冒險，非傳統',
      text: '你是一位追尋者,以你的權杖「手杖和獵捕真相的箭」作為象徵。像一位冥想者，在探索找尋你到底是誰。像一位旅行家，探索你從何處來，要往何處去。成為一位追求學習生命為何和如何的學生。就像小孩一般，利用你天生有如動物般的感知能力去發掘真理。真的去看(鹿)，去聽(兔子)，去感受(腮鬚)。去聞(老鼠)去品嘗(狼)。透過這些感官的體驗，你更加瞭解生命。就像動物一般，相信你的直覺。傾聽你的感官要跟你說的話。'
    },
    {
      name: 'knightWands',
      title: '權杖智者 Sage of Wands',
      mean: '先知 Seer',
      // keyword: '自信，決心，熱情，冒險，行動',
      text: '你是一位智者，你已經看到那道光，就像牧師、和尚、印度聖人薩圖、魔法師、女祭司、薩滿巫師，你已經看到你的不朽。因為不害怕死亡，你成為永恆的光芒、火焰、指引大家進化到更高層次的覺醒。你在靈性技能或鍛鍊上的精通，使你能透過能量、覺察、特質和純淨去喚醒與啟發(禪書法家-啟發文字的力量；西藏吟唱者-聲音的力量；印度聖人薩圖-冥想的力量:夏威夷先知-先見的力量；薩滿巫師-療癒的力量；希臘東正教祭司-符號和儀式的力量)。運用對你來說行得通的工具與流程，去分享你的智慧與天賦。'
    },
    {
      name: 'queenWands',
      title: '權杖女人 Woman of Wands',
      mean: '感應者/靈媒 Sensor',
      // keyword: '獨立，溫暖，目標導向，支持，快樂，熱情，決心',
      text: '作為一個感應者，你擁有心靈溝通的力量，透過你的感知權杖和觸角(頭飾、手指、頭髮、皮膚、神經元、氣場)所接收。你透過金色身體氣場的權杖接受到心靈感應，這個感應帶給你異常銳的感官覺察與通靈能力。透過調節和磨練身體的這根權杖，你被賦予千里眼(看見真理)順風耳(聽到真理)，敏銳的直覺力(感應到真理)透過内在權杖般複雜的神經系統，你可以很快速的吸收大量資訊。相信你所認知到的方式。你的通靈和直覺的能力讓你看穿許多面具、防衛和偽裝。透過你超敏銳的辨識和直覺能力，去發掘那些隱晦和隱藏的，好的與壞的。別試圖去緩和你敏銳的覺知，把你所觀察到的忠實呈現出來你是一個傳遞者。自然而狂野，鲜明而又富藝術性，感性且又帶有儀式性的莊嚴。你是一位女薩滿巫師。到這世界上來賦予活力，解放和療癒。'
    },
    {
      name: 'kingWands',
      title: '權杖男人 Man of Wands',
      mean: '行動者/演員 Actor',
      // keyword: '企業家精神，尊重，榮譽，領導力，雄心勃勃，魅力十足',
      text: '作為一位演員，你的魔法杖就是你所穿戴的面具和戲服。你可以轉變成不同的人格特質，男人或女人、藝妓或戰士、小鳥或野獸，你可以很快地同理和明白他人的感受與體驗。透過表演、戲劇、舞蹈、格鬥和儀式，你從自己的内在淬取出一般人和特殊人全系列的特質。你啟發並震攝人心，改變並轉換他們的意識。與那個在面具下最真實的你接觸：不自以為是、純淨、全然覺醒的。你是完整而無缺的，多才多藝的生命體。你是被解放的，去超越既定身分所帶來的安全感，去扮演社會上的各種角色。把世界當作是你的舞台，你徹底的展現出超強的適應能力和多樣面的才藝。正因為你已跳脫任何個體角色的束縛，人生遂變得輕鬆好玩。持續保持即興、即知即行、並賦予他人力量。'
    },
    // ---
    {
      name: 'acePentacles',
      title: '世界王牌 Ace of Worlds',
      mean: '成功 Success',
      // keyword: '豐富，新的開始，強大的決策能力，穩定性，聲明',
      text: '現實世界的成功意著你已完全立足並佔有一席之地，是以堅實和完整的有形球體作為象徵，例如:行星。在太陽系裡彼此相互關聯的行星，全部集結在一起，象徵著成功在物質層面上擁有一切是時候把自己所擁有的整合在一起。去籌組連結並發揮協同的力量。確保你向自己已經擁有的成就致意。每一顆行星代表你在現實生活中特定領域裡的成功，也顯現出你是如何去達成的雙重意義。運用希臘宙斯主神所代表的擴張性(以木星作為象徵)，去得你在財務層面(木星)的成功。在工作上(土星)。謹守農神的紀律和勤奮努力(以土星作為象徵)來獲得成功。在社交關係上(月亮)，運用你情感的敏感度和溝通(以月亮作為象徵)來取得成功。在家庭層面(地球)透過安處在家中並給予家庭實際的照顧來獲取成功。而你在身體健康上的成功(以太陽作為象徵)，就得像太陽般，透過鍛辣身體和保持活躍來創造出更大的能量。'
    },
    {
      name: 'twoPentacles',
      title: '世界二 Two of Worlds',
      mean: '反映 Reflection',
      // keyword: '靈活性，時間管理，優先級，多任務，以樂趣為導向，雙贏',
      text: '月亮、冬天、池塘與夜晚代表著休息與反省在你身體放鬆與心靈沈澱之際，去釐清和具體化你自己的感覺與計畫，就如同「雪」所象徵的狀態一它是「水」的結晶。在確定前不要輕舉妄動從一切中抽離，以獲得洞察力。靜待觀望月亮的樸實與寒冬的緊縮，代表保守傾向。簡單且儉樸的過生活，別致力於財務消費，追逐名利與物質上的佔有。'
    },
    {
      name: 'threePentacles',
      title: '世界三 Three of Worlds',
      mean: '滋養/孕育 Nurturing',
      // keyword: '合作，學習，知識，專業知識，能力，團隊合作，成就',
      text: '帶著幼兒的母象與母鳥，象徵著培育年輕的生命直到完全開花結果。夏天，象徵著照顧你在春天裡所誕生和剛萌芽的一切。培育需要像愛神維納斯-Venus(金星)般溫柔的愛心照顧，也需要大樹般母愛的保護就像大象以其象鼻伸出支持的手。 農場工人的手及土星，象徵你在事業上所需要投注的耐心與堅持，以及為了套育成功所必須扛起的責任。收成就在眼前，繼續向前，為確保成功再多做一點。'
    },
    {
      name: 'fourPentacles',
      title: '世界四 Four of Worlds',
      mean: '新的開始 Commencement',
      // keyword: '尋求安慰者，唯物主義，崇高地位，財務安全，財產，穩定性，控制力',
      text: '春天,以綠色的花卉幼芽來代表，象徵著一個新的開始和起點。像鱷魚和新島嶼的誕生一樣,是時候突破你思想上的沉思並採取行動! 牡羊座的公羊向前方，代表你應該從冬天的省思中動身前進了，放手去做吧!縱身躍入新的冒險裡並鍛鍊你的身體。星和花卉幼芽代表男性的生殖器,象徵著新種子的播種，這些種子將會透過你的創意和性能量，充分拓展開來。'
    },
    {
      name: 'fivePentacles',
      title: '世界五 Five of Worlds',
      mean: '挫折 Setback',
      // keyword: '孤獨，不安全感，缺乏支持，金錢損失，困難，痛苦，精神痛苦',
      text: '就如同地球遭受到破壞與災害,你所擁有最美好、最有利、最慎密籌劃的項目和計畫--這些你所倚靠且累積的心血,正面臨挫折：資源的枯竭(乾)。如其來的毀滅(颶風、森林大火火山爆發)，障礙(牆垣)或道路分歧(被遺棄的村莊、失敗和困境就像地球上的天災一樣會重複發生。泥土上健康的新種子象微了新生命，每場暴風雨過後總會有道彩虹。退一步--這是一個策略性的退避一以便能再往前跨兩步,穿過剛開啟的機會之門·如同俗諺所說,吃苦當吃補,以樂觀的心去面對逆境。'
    },
    {
      name: 'sixPentacles',
      title: '世界六 Six of Worlds',
      mean: '協力 Synergy',
      // keyword: '慈善事業，崇高地位，分享，吹牛，幫助，富裕',
      text: '六個行星聚集在一起共同組合成一個大輪子和充滿力量的世界。透過動態整合你旗下的資產人才來共同推進和成長。將你自己所擁有的内在資源(由行星·元素、礦物、植物、燃料、季節和機器來作為象徵)和夥伴(天鹅作為象徵)的交織結合起來,你就能創造出綜效的力量:一股強大、努力不懈、專注、與持續進步的充沛創意能量。透過團隊合作和協同運作的集體能量，你將能達到自己獨自一人所無法做到的更大目標。去組成團隊和夥伴合作,並善用網絡。拿出能量來!往前走。'
    },
    {
      name: 'sevenPentacles',
      title: '世界七 Seven of Worlds',
      mean: '突破 Breakthrough',
      // keyword: '長期遠見，耐心，投資，成功，獎勵，戶外旅行，渴望獲得更多',
      text: '就像太陽穿透了黑暗、火山衝破了禁的岩石,你也正在突破。當你將自己從壓抑中解放,激發出力量與熱情時,需要抱持著像戰馬和火焰般的決心和意志 去穿越阻礙障礙、靜止和停滯。是時候去運用你的天賦和能量往前衝了。別讓任何事阻饒你。'
    },
    {
      name: 'eightPentacles',
      title: '世界八 Eight of Worlds',
      mean: '改變 Change',
      // keyword: 
      text: '如同樹木和季節,你在持續不斷的改變中。做變色龍和葉蟲那樣改變自身的顏色去適應新的現實環境:像蛇蛻皮般,放掉你舊有和已故的事實:像鹿一樣自然的偽裝以融入環境。適應現況:像蛾在經歷蛻變,你也在蛻變。去改變自己以應你的現況 同時要跟上現實持續在變换的腳步。透過如此柔軟和彈性的調整，你將得以生存。'
    },
    {
      name: 'ninePentacles',
      title: '世界九 Nine of Worlds',
      mean: '豐收 Harvest',
      // keyword: '享受，激情，創造力，自然愛好者，豪華，安全，自信，感激',
      text: '就像滿月已完成它的循環,秋天象徵著工作已完成。你過往所努力的成果已經成熟並等候收割:經由你深思熟慮的謀劃(冬天)、播種(春天)、培育(夏天)··現在該是採收的時刻了你已經做得夠多也獲得夠多了,把它集合起來、包装好並送去市場。相信你所產出的價值，不要賤賣自己。收成提供給你實質的資金和保障,如同松鼠收集堅果--為休眠時期及嚴冬作準備。未雨網繆。未完成的計畫和未完結的事務,就像掉落的果實會腐敗和爛去。這類廢物將會阻礙你前進到全新開始的春天。'
    },
    {
      name: 'tenPentacles',
      title: '世界十 Ten of Worlds',
      mean: '報酬/回饋 Reward',
      // keyword: '退休，安全，安寧，面向家庭，繼承，強大的根基，遺產',
      text: '木星的「財富之輪」象徵著報酬。生活已經轉變成順境。滿溢出來的購物推車象徵財富的聚寶盆。由於你工作圓滿和卓越的完成，在彩虹的盡頭，你的夢想得以實現，以黄金罐作為報需來象徵獎賞你自己及他人。去度假，盡情享用美食，跟隨你內在的渴望好好款待自己，盡情享受。要確保持續成功，就跟随你的夢想(彩虹)，你的收益和豐盛--存在於你的願景與夢想中。去追尋它們!'
    },
    {
      name: 'pagePentacles',
      title: '世界小孩 Child of Worlds',
      mean: '遊戲者 Player',
      // keyword: '新起點，目標導向，視覺吸引力，實用，重塑，自我保健，令人興奮的機會',
      text: '在你現實生活裡你是一個學徒,像個有抱負的門牛士正學習去精通你的技藝·這是一個進入到「真實」世界的起始時刻(對峙的小牛，土著和馬塞族人的成年禮儀式),從此刻起,你開始得承擔更多的責任。你仍然處在有飛盤、球、泡泡和氣球的兒童世界裡--在這世界裡生活即是遊戲。把你迪斯尼飛碟的夢和幻想演化出來。透過你的想像力歡樂和遊戲、藝術和運動，你將會在自己的内心重新建立起一個孩子般的生命力與魔法。'
    },
    {
      name: 'knightPentacles',
      title: '世界智者 Sage of World',
      mean: '大師 Master',
      // keyword: '注重結果，雄心，勤奮，正統，效率，系統計劃',
      text: '經驗的累積，讓你對自己的這門技藝已然精通無比。因為你知道世界是如何運轉的，你已經掌握「財富之輪」了。身為一門技藝上的大師，你在工作中看見自己的迴響。執行你的工作並且完美地達成你的任務。運用你現實的生活去發展你内在的品格。致力於實踐「正確生活之道」--活得健康、富裕、快樂和神聖至善。透過你的學問和你努力的成果所達成的品質，你赢得了權力和地位,這以皇冠和鹿角象徵，雖然已是山中之王。但仍要保持謙卑、謙虛並分享你的資源。作為一位已有成就的人物，在你的工作中放輕鬆、把它當作遊戲並且享受它·花時間去從事你的嗜好，補充活力，跟你的朋友在一起以及路上一條靈性道路。'
    },
    {
      name: 'queenPentacles',
      title: '世界女人 Woman of Worlds',
      mean: '孕育者 Preserver',
      // keyword: '活力，愛，謙虛，服從，現實，富有同情心，勤奮，天生愛人，女性特質，社交蝴蝶',
      text: '你是母親，一位創造和養育幼小生命的孕育者。你透過提供一個家(鳥窩、蛋、子宫、地球)來保育生命，讓年輕的生命得以在愛、安全和舒適中成長透過與生俱來的家政技能與才華，你創造出具有庇護功能、食物、衣服(編織)，工具(瓶、碗、湯匙)這些必要條件的維生系統。你是傳統的守護者。堅守著家和家庭的社會結構。透過實踐來保存技藝(編織家、舞蹈家、陶瓷藝術家)。透過攝取適當的營養(食物)和運動(跳舞)維護你的身體。用你身體感官上的享受和優雅的魅力來表達你自己。你的繁殖力象微你強健的身體健康狀態。此外，透過維護大自然的生態健康來為保護地球本體盡一份力。'
    },
    {
      name: 'kingPentacles',
      title: '世界男人 Man of Worlds',
      mean: '成就者 Achiever',
      // keyword: '具有商業頭腦，智慧，舒適，紀律，野心，安全，力量，獲得豐富財富的能力，以職業為導向，成功',
      text: '你為了成就而奮鬥。透過你所創造的商品數量(競技場、聚寶盆)、你所建造的組織結構(建築物)、你所開發的資源(鑽孔者)、你所累積的財富(汽車、飛機)、你打破成就的紀錄(一號的跑者)、你所赢得的地位(勞斯萊斯-RollsRoyce)和你所發現的新世界(太空人、月球上的腳印)來衡量成功。設定目標，訂定計畫並開始幹活。具備象徵著土星般農神的紀律，木星般的擴展，工蜂般的勤勞，團隊合作的綜效，以及跑者的意志力與競爭力，你將會達成你所設的目標和水準。'
    }
  ]

  // if (global.tarotClass) {
  //   global.tarotClass.prototype.language = {
  //     tw: {
  //       card: []
  //     },
  //     en: {
  //       card: []
  //     }
  //   }
  //   global.tarotClass.prototype.language.tw.card = majorArcana.concat(minorArcana)
  // }
  if(!global.language){
    global.language = {}
  }
  global.language.Voyager = {
    tw: {
      card: []
    },
    en: {
      card: []
    }
  }
  global.language.Voyager.tw.card = majorArcana.concat(minorArcana)
})(window)